Galeaf/Corvus/custom_board/Corvus-0.0.6/variants/Organ/pins_arduino.h
	NOT_ON_TIMER	, // PG 3 ** 77 ** D57
	NOT_ON_TIMER	, // PG 4 ** 78 ** D58
		
	NOT_ON_TIMER	, // PH 2 ** 79 ** D59
	NOT_ON_TIMER	, // PH 7 ** 80 ** D60
	
	NOT_ON_TIMER	, // PD 5 ** 81 ** D61
	NOT_ON_TIMER	, // PD 6 ** 82 ** D62
	
	NOT_ON_TIMER	, // PE 2 ** 83 ** D63
	NOT_ON_TIMER	, // PE 6 ** 84 ** D64
	NOT_ON_TIMER	, // PE 7 ** 85 ** D65
	
};

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE3       Serial3
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial2
#define SERIAL_PORT_HARDWARE_OPEN2  Serial3


// ATMEGA2560 GPIO on MK board
// PORT A
#define PIN_PA0   (22)	// default MEGA
#define PIN_PA1   (23)	// default MEGA
#define PIN_PA2   (24)	// default MEGA
#define PIN_PA3   (25)	// default MEGA
#define PIN_PA4   (26)	// default MEGA
#define PIN_PA5   (27)	// default MEGA
#define PIN_PA6   (28)	// default MEGA
#define PIN_PA7   (29)	// default MEGA

// PORT B
#define PIN_PB0   (53)	// default MEGA
#define PIN_PB1   (52)	// default MEGA
#define PIN_PB2   (51)	// default MEGA
#define PIN_PB3   (50)	// default MEGA
#define PIN_PB4   (10)	// default MEGA
#define PIN_PB5   (11)	// default MEGA
#define PIN_PB6   (12)	// default MEGA
#define PIN_PB7   (13)	// default MEGA

// PORT C
#define PIN_PC0   (37)	// default MEGA
#define PIN_PC1   (36)	// default MEGA
#define PIN_PC2   (35)	// default MEGA
#define PIN_PC3   (34)	// default MEGA
#define PIN_PC4   (33)	// default MEGA
#define PIN_PC5   (32)	// default MEGA
#define PIN_PC6   (31)	// default MEGA
#define PIN_PC7   (30)	// default MEGA

// PORT D
#define PIN_PD0   (21)	// default MEGA
#define PIN_PD1   (20)	// default MEGA
#define PIN_PD2   (19)	// default MEGA
#define PIN_PD3   (18)	// default MEGA
#define PIN_PD4   (70)	//__CUSTOM__
#define PIN_PD5   (81)	//__CUSTOM__
#define PIN_PD6   (82)	//__CUSTOM__
#define PIN_PD7   (38)	// default MEGA

// PORT E
#define PIN_PE0   (0)	// default MEGA
#define PIN_PE1   (1)	// default MEGA
#define PIN_PE2   (83)	//__CUSTOM__
#define PIN_PE3   (5)	// default MEGA
#define PIN_PE4   (2)	// default MEGA
#define PIN_PE5   (3)	// default MEGA
#define PIN_PE6   (84)	//__CUSTOM__
#define PIN_PE7   (85)	//__CUSTOM__

// PORT F
#define PIN_PF0   (54)	// default MEGA
#define PIN_PF1   (55)	// default MEGA
#define PIN_PF2   (56)	// default MEGA
#define PIN_PF3   (57)	// default MEGA
#define PIN_PF4   (58)	// default MEGA
#define PIN_PF5   (59)	// default MEGA
#define PIN_PF6   (60)	// default MEGA
#define PIN_PF7   (61)	// default MEGA

// PORT G
#define PIN_PG0   (41)	// default MEGA
#define PIN_PG1   (40)	// default MEGA
#define PIN_PG2   (39)	// default MEGA
#define PIN_PG3   (77)	//__CUSTOM__
#define PIN_PG4   (78)	//__CUSTOM__
#define PIN_PG5   (4)	// default MEGA

// PORT H
#define PIN_PH0   (17)	// default MEGA
#define PIN_PH1   (16)	// default MEGA
#define PIN_PH2   (79)	//__CUSTOM__
#define PIN_PH3   (6)	// default MEGA
#define PIN_PH4   (7)	// default MEGA
#define PIN_PH5   (8)	// default MEGA
#define PIN_PH6   (9)	// default MEGA
#define PIN_PH7   (80)	//__CUSTOM__

// PORT J
#define PIN_PJ0   (14)	// default MEGA
#define PIN_PJ1   (15)	// default MEGA
#define PIN_PJ2   (71)	//__CUSTOM__
#define PIN_PJ3   (72)	//__CUSTOM__
#define PIN_PJ4   (73)	//__CUSTOM__
#define PIN_PJ5   (74)	//__CUSTOM__
#define PIN_PJ6   (75)	//__CUSTOM__
#define PIN_PJ7   (76)	//__CUSTOM__

// PORT K
#define PIN_PK0   (62)	// default MEGA
#define PIN_PK1   (63)	// default MEGA
#define PIN_PK2   (64)	// default MEGA
#define PIN_PK3   (65)	// default MEGA
#define PIN_PK4   (66)	// default MEGA
#define PIN_PK5   (67)	// default MEGA
#define PIN_PK6   (68)	// default MEGA
#define PIN_PK7   (69)	// default MEGA

// PORT L
#define PIN_PL0   (49)	// default MEGA
#define PIN_PL1   (48)	// default MEGA
#define PIN_PL2   (47)	// default MEGA
#define PIN_PL3   (46)	// default MEGA
#define PIN_PL4   (45)	// default MEGA
#define PIN_PL5   (44)	// default MEGA
#define PIN_PL6   (43)	// default MEGA
#define PIN_PL7   (42)	// default MEGA

// BAORD IO
#define LED_DATA	PIN_PG5

#define SERIAL0_RX 	PIN_PE0
#define SERIAL0_TX 	PIN_PE1

#define SERIAL3_RX 	PIN_PJ0
#define SERIAL3_TX 	PIN_PJ1

#define MIDI_IN 	SERIAL3_RX
#define MIDI_OUT 	SERIAL3_TX

#define MUTE		PIN_PE4

#define MCU_DF_RX 	PIN_PH0
#define MCU_DF_TX 	PIN_PH1

#define MOTOR_1 	PIN_PH3
#define MOTOR_2 	PIN_PH4

#define SPI_SCK 	PIN_PB1
#define SPI_MOSI 	PIN_PB2
#define SPI_MISO 	PIN_PB3

#define EM_2 		PIN_PL2
#define EM_1	 	PIN_PL3

#define RS485_TX 	PIN_PD2
#define RS485_RX 	PIN_PD3
#define RS485_RE_DE	PIN_PD4

#define DIN1 		PIN_PK0
#define DIN2 		PIN_PK1
#define DIN3 		PIN_PK2
#define DIN4 		PIN_PK3
#define DIN5 		PIN_PK4
#define DIN6 		PIN_PK5
#define DIN7 		PIN_PK6
#define DIN8 		PIN_PK7
#define DIN9 		PIN_PJ6
#define DIN10 		PIN_PJ5
#define DIN11 		PIN_PJ4
#define DIN12 		PIN_PJ3
#define DIN13 		PIN_PJ2

#endif
